driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_onProcess/Input2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler2">
  <soapenv:Body><inv:EventHandler2Element2>
<inv:string2>1.11</inv:string2>
       </inv:EventHandler2Element2>
  </soapenv:Body>
</soapenv:Envelope>