driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_onProcess/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler2">
  <soapenv:Body><inv:EventHandler2Element>
<inv:string>1.11</inv:string>
       </inv:EventHandler2Element>
  </soapenv:Body>
</soapenv:Envelope>